
#Region Protected

Function CreateOneTimeToken(SecretKey) Export     
	
	ТокенДоступа = Новый ТокенДоступа; 
	ТокенДоступа.Эмитент = "ssl";     
	МассивПолучателей = Новый Массив;
    МассивПолучателей.Добавить("mol_Moleculer");
	ТокенДоступа.Получатели = МассивПолучателей;     
	ТокенДоступа.КлючСопоставленияПользователя = "Moleculer";
	ТокенДоступа.ВремяСоздания = ТекущаяУниверсальнаяДата() - Дата(1970,1,1,0,0,0); 
	ТокенДоступа.ВремяЖизни = 3600; 
	ТокенДоступа.Подписать(АлгоритмПодписиТокенаДоступа.HS256, SecretKey); 
	
	Return String(ТокенДоступа);
	
EndFunction

#EndRegion
